#### Terraform Format and Style 🖌`success`
#### dev - Terraform Initialization ⚙️`success`
#### dev - Terraform Validation 🤖Success! The configuration is valid.


#### dev - Terraform Plan 📖`success`

<details><summary>dev - Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.cda-app.data.google_dns_managed_zone.dns_zone[0]: Refreshing state...
module.core-infrastructure.module.k8s-master.data.google_container_engine_versions.cluster_versions: Refreshing state... [id=2020-11-23 18:44:10.9779641 +0000 UTC]
module.core-infrastructure.module.k8s-master.data.google_project.project: Refreshing state... [id=projects/broad-cda-dev]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=broad-cda-dev/serviceusage.googleapis.com]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/broad-cda-dev/global/sslPolicies/global-ssl-policy]
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=broad-cda-dev/cloudresourcemanager.googleapis.com]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/broad-cda-dev/global/securityPolicies/broad-cloud-armor]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=broad-cda-dev/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=broad-cda-dev/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=broad-cda-dev/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=broad-cda-dev/compute.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=broad-cda-dev/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=broad-cda-dev/logging.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=broad-cda-dev/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=broad-cda-dev/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=broad-cda-dev/dns.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=broad-cda-dev/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=broad-cda-dev/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=broad-cda-dev/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=broad-cda-dev/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=broad-cda-dev/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=broad-cda-dev/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=broad-cda-dev/container.googleapis.com]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/broad-cda-dev/global/networks/dev-network]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/broad-cda-dev/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_dns_managed_zone.dns_zone[0]: Refreshing state... [id=projects/broad-cda-dev/managedZones/cda-dev]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/broad-cda-dev/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/broad-cda-dev/regions/us-central1/subnetworks/dev-subnet]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/broad-cda-dev/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/broad-cda-dev/locations/us-central1/clusters/cda-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=broad-cda-dev/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-nodes["cda-node-us-central-1"].google_container_node_pool.pool[0]: Refreshing state... [id=projects/broad-cda-dev/locations/us-central1/clusters/cda-master-us-central1/nodePools/cda-node-us-central-1]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cda-app.google_compute_global_address.global_ip_address will be created
  + resource "google_compute_global_address" "global_ip_address" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cda-dev-ip"
      + project            = (known after apply)
      + self_link          = (known after apply)
    }

  # module.cda-app.google_dns_record_set.a_dns[0] will be created
  + resource "google_dns_record_set" "a_dns" {
      + id           = (known after apply)
      + managed_zone = "cda-dev"
      + name         = "cda-global.cda-dev.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # module.cda-app.google_dns_record_set.cname_dns[0] will be created
  + resource "google_dns_record_set" "cname_dns" {
      + id           = (known after apply)
      + managed_zone = "cda-dev"
      + name         = "cda.cda-dev.broadinstitute.org."
      + project      = (known after apply)
      + rrdatas      = [
          + "cda-global.cda-dev.broadinstitute.org.",
        ]
      + ttl          = 300
      + type         = "CNAME"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @smark88, Action: `pull_request`, Working Directory: `./cda`, Workflow: `Terraform Plan`*